In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/erkansirin78/datasets/master/simple_data.csv")

In [3]:
df.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

In [4]:
df.columns

Index(['sirano', 'isim', 'yas', 'meslek', 'sehir', 'aylik_gelir'], dtype='object')

In [5]:
df[['sirano', 'isim', 'yas', 'meslek', 'sehir', 'aylik_gelir']] \
.head(5)

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

In [8]:
df[df['sehir'] == 'Istanbul'].head(5)

   sirano      isim  yas       meslek     sehir  aylik_gelir
2       3     Timur   30     Müzisyen  Istanbul         9000
6       7     Dilek   29  Pazarlamaci  Istanbul         7300
7       8     Murat   31     Müzisyen  Istanbul        12000
9      10  Muhittin   46       Berber  Istanbul        12000

In [7]:
df[ (df['sehir'] == 'Istanbul') & (df['yas'] > 40)].head(5)

   sirano      isim  yas  meslek     sehir  aylik_gelir
9      10  Muhittin   46  Berber  Istanbul        12000

In [12]:
df.groupby(['meslek'])['aylik_gelir','yas'] \
.agg(['mean']) \
.reset_index() \
.head(5)

     meslek   aylik_gelir   yas
                     mean  mean
0    Berber   9866.666667  46.0
1    Doktor  16125.000000  35.0
2      Isci   3500.000000  35.0
3     Memur   4066.666667  36.0
4  Müzisyen  10500.000000  30.5

In [15]:
df.groupby(['meslek'])['aylik_gelir','yas'] \
.agg(['mean']) \
.reset_index() \
.sort_values([('aylik_gelir','mean')], ascending=False) \
.head(5)

        meslek   aylik_gelir   yas
                        mean  mean
1       Doktor  16125.000000  35.0
4     Müzisyen  10500.000000  30.5
0       Berber   9866.666667  46.0
5  Pazarlamaci   5750.000000  29.0
7   Tuhafiyeci   4800.000000  47.0

In [18]:
df.loc[df['meslek'].isna()].head()

    sirano     isim  yas meslek   sehir  aylik_gelir
4        5  Yasemin   23    NaN   Bursa         4800
14      15   Şehmuz   41    NaN  Ankara         8700

In [19]:
df.loc[df['meslek'].isna(), 'meslek'] = 'Saraç'

In [20]:
df.loc[df['meslek'] == 'Saraç'].head()

    sirano     isim  yas meslek   sehir  aylik_gelir
4        5  Yasemin   23  Saraç   Bursa         4800
14      15   Şehmuz   41  Saraç  Ankara         8700

In [21]:
df.loc[df['isim'] == 'Gençay'].head()

    sirano    isim  yas  meslek   sehir  aylik_gelir
15      16  Gençay   46  Berber  Ankara         8800
16      16  Gençay   46  Berber  Ankara         8800

In [22]:
df = df.loc[df['isim'] != 'Gençay']

In [23]:
df.loc[df['isim'] == 'Gençay'].head()

Empty DataFrame
Columns: [sirano, isim, yas, meslek, sehir, aylik_gelir]
Index: []